In [1]:
import numpy as np
import pandas as pd
import matplotlib

In [4]:
data = pd.read_csv("datatset_airplaneprices_PE42_Tanmay Kapoor_Preprocessing.csv")

# Viewing data

In [5]:
#first 5 rows of dataset
data.head()

,Year,Quarter,U.S. Average (Current $),U.S. Average (Inflation-Adjusted $)
0,1995,1,296.90,466.98
1,1995,2,296.80,463.46
2,1995,3,287.51,446.91
3,1995,4,287.78,446.44
4,1996,1,283.97,434.31

In [6]:
#bottom 5 rows
data.tail()

,Year,Quarter,U.S. Average (Current $),U.S. Average (Inflation-Adjusted $)
80,2015,1,388.32,391.63
81,2015,2,385.91,385.09
82,2015,3,371.72,372.01
83,2015,4,362.56,365.02
84,2016,1,361.20,361.20

# Checking for missing values

In [7]:
data.isnull()

,Year,Quarter,U.S. Average (Current $),U.S. Average (Inflation-Adjusted $)
0,False,False,False,False
1,False,False,False,False
2,False,False,False,False
3,False,False,False,False
4,False,False,False,False
...,...,...,...,...
80,False,False,False,False
81,False,False,False,False
82,False,False,False,False
83,False,False,False,False
84,False,False,False,False

In [8]:
#if any value null
data.isnull().values.any()

True

In [9]:
data.isnull().any()

Year                                   False
Quarter                                False
U.S. Average (Current $)                True
U.S. Average (Inflation-Adjusted $)     True
dtype: bool

In [10]:
#size of dataset in terms of rows and cols
data.shape

(85, 4)

In [11]:
#column titles
data.columns

Index(['Year', 'Quarter', 'U.S. Average (Current $)',
       'U.S. Average (Inflation-Adjusted $)'],
      dtype='object')

In [12]:
data.dtypes

Year                                     int64
Quarter                                  int64
U.S. Average (Current $)               float64
U.S. Average (Inflation-Adjusted $)    float64
dtype: object

In [13]:
#stadium of first 5 rows
print(data[0:5]['U.S. Average (Current $)'])

0    296.90
1    296.80
2    287.51
3    287.78
4    283.97
Name: U.S. Average (Current $), dtype: float64

In [14]:
#stadium and city of whole
print(data.loc[:, ['Quarter', 'U.S. Average (Current $)']])

    Quarter  U.S. Average (Current $)
0         1                    296.90
1         2                    296.80
2         3                    287.51
3         4                    287.78
4         1                    283.97
..      ...                       ...
80        1                    388.32
81        2                    385.91
82        3                    371.72
83        4                    362.56
84        1                    361.20

[85 rows x 2 columns]

In [15]:
#how many null values in each col
data.isnull().sum()

Year                                    0
Quarter                                 0
U.S. Average (Current $)               10
U.S. Average (Inflation-Adjusted $)     8
dtype: int64

In [16]:
print(data[40:50]['U.S. Average (Inflation-Adjusted $)'].isnull())

40     True
41    False
42    False
43     True
44    False
45    False
46    False
47    False
48    False
49    False
Name: U.S. Average (Inflation-Adjusted $), dtype: bool

In [17]:
#fills missing values
data.fillna(0)

,Year,Quarter,U.S. Average (Current $),U.S. Average (Inflation-Adjusted $)
0,1995,1,296.90,466.98
1,1995,2,296.80,463.46
2,1995,3,287.51,446.91
3,1995,4,287.78,446.44
4,1996,1,283.97,434.31
...,...,...,...,...
80,2015,1,388.32,391.63
81,2015,2,385.91,385.09
82,2015,3,371.72,372.01
83,2015,4,362.56,365.02
84,2016,1,361.20,361.20

In [18]:
#mean of all years
print(data['U.S. Average (Inflation-Adjusted $)'].mean())
# print(dataset[0:50]['Year'])

404.4940259740261

# Dropping rows with missing values

In [19]:
data_without_null = data.dropna()
data_without_null

,Year,Quarter,U.S. Average (Current $),U.S. Average (Inflation-Adjusted $)
0,1995,1,296.90,466.98
1,1995,2,296.80,463.46
2,1995,3,287.51,446.91
3,1995,4,287.78,446.44
4,1996,1,283.97,434.31
...,...,...,...,...
80,2015,1,388.32,391.63
81,2015,2,385.91,385.09
82,2015,3,371.72,372.01
83,2015,4,362.56,365.02
84,2016,1,361.20,361.20

# Replcaing missing values with mean

In [20]:
#not working
data["U.S. Average (Inflation-Adjusted $)"].replace(np.NaN, data["U.S. Average (Inflation-Adjusted $)"].mean())

0     466.98
1     463.46
2     446.91
3     446.44
4     434.31
       ...
80    391.63
81    385.09
82    372.01
83    365.02
84    361.20
Name: U.S. Average (Inflation-Adjusted $), Length: 85, dtype: float64

In [23]:
#working
data["U.S. Average (Current $)"].fillna(data["U.S. Average (Current $)"].mean())

0     296.90
1     296.80
2     287.51
3     287.78
4     283.97
       ...
80    388.32
81    385.91
82    371.72
83    362.56
84    361.20
Name: U.S. Average (Current $), Length: 85, dtype: float64

In [24]:
print(data[40:50]['U.S. Average (Inflation-Adjusted $)'].isnull())
data.isnull().any()

40     True
41    False
42    False
43     True
44    False
45    False
46    False
47    False
48    False
49    False
Name: U.S. Average (Inflation-Adjusted $), dtype: bool

Year                                   False
Quarter                                False
U.S. Average (Current $)                True
U.S. Average (Inflation-Adjusted $)     True
dtype: bool

In [25]:
print(data[40:50]['U.S. Average (Current $)'])

40       NaN
41    306.68
42    305.91
43       NaN
44    323.34
45    341.58
46    330.12
47    318.16
48    317.84
49    325.39
Name: U.S. Average (Current $), dtype: float64